test-common/docs/AX-WS-Requests/UpdateInvoiceRule.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dat="http://schemas.microsoft.com/dynamics/2010/01/datacontracts" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:ser="http://schemas.microsoft.com/dynamics/2008/01/services" xmlns:ent="http://schemas.microsoft.com/dynamics/2006/02/documents/EntityKeyList" xmlns:ent1="http://schemas.microsoft.com/dynamics/2006/02/documents/EntityKey" xmlns:mds="http://schemas.microsoft.com/dynamics/2008/01/documents/MDS_ITGSalesInvR">
   <soapenv:Header>
      <dat:CallContext>
         <dat:Company>SE02</dat:Company>
         <dat:LogonAsUser>TRADEDOUBLER\ITG-AX_Test</dat:LogonAsUser>
      </dat:CallContext>
   </soapenv:Header>
   <soapenv:Body>
      <ser:MDS_ITGSalesInvRServiceUpdateRequest>
         <ent:EntityKeyList>
            <ent1:EntityKey>
               <ent1:KeyData>
                  <ent1:KeyField>
                     <ent1:Field>InvoiceRuleId</ent1:Field>
                     <ent1:Value>{3f2504e0-4f89-11d3-9a0c-0305e82c3405}</ent1:Value>
                  </ent1:KeyField>
               </ent1:KeyData>
            </ent1:EntityKey>
         </ent:EntityKeyList>
         <mds:MDS_ITGSalesInvR>
            <mds:MDS_SalesInvoiceRule class="entity" action="update">
               <mds:_DocumentHash>5841df46b477bcfed8db4dd4f93526c1</mds:_DocumentHash>
               <mds:BelongsToDataAreaId>SE02</mds:BelongsToDataAreaId>
               <mds:CurrencyCode>SEK</mds:CurrencyCode>
               <mds:CustomerReference>John Doe updated</mds:CustomerReference>
               <mds:Description>Description updated</mds:Description>
               <mds:DeviatingExchRate>Yes</mds:DeviatingExchRate>
               <mds:DisplayTDComission>No</mds:DisplayTDComission>
               <mds:DistributionMode>Email</mds:DistributionMode>
               <mds:InvoiceRuleId>{3f2504e0-4f89-11d3-9a0c-0305e82c3405}</mds:InvoiceRuleId>
               <mds:IssuerReference>Max Revenue updated</mds:IssuerReference>
               <mds:Name>Morgontest updated</mds:Name>
               <mds:PaymModeId>BANK</mds:PaymModeId>
               <mds:PaymTermId>30</mds:PaymTermId>
               <mds:PostingProfile>STD</mds:PostingProfile>
               <mds:RevenueTypeId>1</mds:RevenueTypeId>
               <mds:MDS_SalesInvoiceMessage class="entity" action="update">
                  <mds:InvoiceMessageId>{885b8421-11f1-4684-1769-3478152e5505}</mds:InvoiceMessageId>
                  <mds:SourceType>InvoiceRule</mds:SourceType>
                  <mds:Text>Test Message Text updated</mds:Text>
                  <mds:ValidFrom>2012-08-25</mds:ValidFrom>
                  <mds:ValidTo>2013-10-30</mds:ValidTo>
               </mds:MDS_SalesInvoiceMessage>
            </mds:MDS_SalesInvoiceRule>
         </mds:MDS_ITGSalesInvR>
      </ser:MDS_ITGSalesInvRServiceUpdateRequest>
   </soapenv:Body>
</soapenv:Envelope>